# St7GetStageGroupState

Returns whether the specified group is currently enabled for a given stage.

long St7GetStageGroupState(long uID, long Stage, long GroupID, bool* Enabled)
Input Parameters
uID
Strand7 model file ID.

Stage
Stage index.
GroupID
The ID number for the specified group.
Output Parameters
Enabled
True indicates that the specified group is enabled for the given stage.

Entity Sets